Revit 2027 API
MechanicalEquipmentSet.Add Method
 Adds member element ids to the mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Add(
	ISet<ElementId> elemIds
)
Public Sub Add (
	elemIds As ISet(Of ElementId)
)
public:
void Add(
	ISet<ElementId^>^ elemIds
)
member Add :
        elemIds : ISet<ElementId> -> unit
Parameters
elemIds ISet<ElementId>
 Element ids to be added to the mechanical equipment set.
Exceptions
Exception | Condition
ArgumentException |  The valid members must have the same classification and system. They cannot be a member of existing set. -or- These elements are serially connected with each other, or with one of the set members.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace